package org.itstep.qa.lesson;

import java.util.Arrays;
import java.util.Scanner;

public class Task08 {
    // Пользователь вводит строку. Программа выводит количество символов самого длинного слова.
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        System.out.println("Введите текст: ");
        String str = sc.nextLine();

    }
}
